# IsBuiltInParameter Method (ElementId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterUtils..::..IsBuiltInParameter Method (ElementId)
ParameterUtils Class See Also
---
Checks whether an ElementId identifies a built-in parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public static bool IsBuiltInParameter(
	ElementId parameterId
)
```

Visual Basic
---
```text
Public Shared Function IsBuiltInParameter ( _
	parameterId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsBuiltInParameter(
	ElementId^ parameterId
)
```

# ### Parameters
parameterId
    Type: Autodesk.Revit.DB..::..ElementId The identifier to check.
# ### Return Value
True if the ElementId identifies a built-in parameter, false otherwise.
# Remarks
An ElementId identifies a built-in parameter if it corresponds to a valid BuiltInParameter value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ParameterUtils Class
IsBuiltInParameter Overload
Autodesk.Revit.DB Namespace